Revit 2027 API
STEPImportOptions Methods
The STEPImportOptions type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from BaseImportOptions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDefaultLengthUnit |  Get the default length unit used for importing unitless files.
(Inherited from BaseImportOptions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLayerSelection |  Get all set layers name which user want to import into Revit.
(Inherited from BaseImportOptions)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetDefaultLengthUnit |  Set the default length unit used for importing unitless files.
(Inherited from BaseImportOptions)
SetLayerSelection |  Set the layers name which user want to import into Revit.
(Inherited from BaseImportOptions)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
STEPImportOptions Class
Autodesk.Revit.DB Namespace